import { Result } from './result';

export const RESULTS: Result[] = [
  {
    id: 1,
    title: '欲求不満な姫',
    description:
      'あなたは「欲求不満な姫」タイプです。周囲にはあなたを慕っている男性がいるかもしれませんが、どこか一線を引いて接していることでしょう。もしくは仲が良くてもあなたを女性だと意識していないことに少し寂しさを感じているかもしれません。あなたが性別を意識せずに人と接することができているならば、それは幸せなことなのだと思います。',
    type: 'A',
  },
  {
    id: 2,
    title: '天性のサークルクラッシャー',
    description:
      'あなたは「天性のサークルクラッシャー」タイプです。実際にクラッシュまでしたことはなくとも、確実に素質はあります。一つのコミュニティであんまり八方美人しない方が無難でしょうし、あなたと性や恋愛じゃないところで仲良くしてくれる人は貴重です。そして、最終的にあなたを肯定できるのはあなただけです。あなたらしく生きましょう',
    type: 'B',
  },
  {
    id: 3,
    title: 'クラッシャーへの同族嫌悪',
    description:
      'あなたは「クラッシャーへの同族嫌悪」タイプです。あなたは孤立することはないでしょうが、よく孤独感を覚えることがあるのではないでしょうか。空気を読める分、恋愛でトラブルを起こす女性に嫌悪感をおぼえたことがあるかもしれません。その反面、あなた自身、恋愛でつらい思いをしてきたのではないですか。あなたを一人の人間として愛してくれない人を好きになるのはやめましょう。そんなマゾ精神はいりません',
    type: 'C',
  },
  {
    id: 4,
    title: '無意識なクラッシャー',
    description:
      'あなたは「無意識なクラッシャー」タイプです。クラッシュまではせずとも、異性に「優しい」だとか「天真爛漫な子だ」とかいう幻想を抱かれることに困ったことがあるのではないでしょうか。そんなあなたに「コビている」だとか「イイコぶってる」だとか言う同性もいるかもしれません。確かにそういったトラブルは苦しいものです。でもそれはあなたの人当たりの良さゆえに起こってしまう悲劇です。程よい距離感を保つための「技術」を単に知らないだけかもしれませんので、「サークラにならないために」https://anond.hatelabo.jp/20130514011806 を一度読んでみることをオススメします。',
    type: 'D',
  },
  {
    id: 5,
    title: '健全な姫',
    description:
      'あなたは「健全な姫」タイプです。「空気を読みすぎて疲れる」ようなことはなく、素直に自分を出せるタイプではないでしょうか。「寂しくて恋愛に依存する」のでもなくて、我が道をゆくタイプでしょう。でも、そんなあなたに「不思議ちゃん」だとか「オタサーの姫」だとか陰口を叩く人もいるかもしれません。あなたは愛されているのですから耳を貸す必要はありません。今、目の前にいる人を大切にしましょう。',
    type: 'E',
  },
  {
    id: 6,
    title: '個人主義',
    description:
      'あなたは「個人主義」タイプです。あなたはトラブルは起こさないものの、人間関係がすごく充実しているわけでもないでしょう。異性からもあまりモテるタイプではないかもしれません。しかし、あなたは恋愛をしたとしてもちゃんと自分のことを大事にできるタイプなので大丈夫です。あなたがあなた自身を肯定できて、大事な人が1人2人いれば、それで十分なのです。',
    type: 'F',
  },
  {
    id: 7,
    title: '内に姫た欲求',
    description:
      'あなたは「内に姫た欲求」タイプです。あなたはあまり恋愛には積極的になれず、周りの同性を羨ましく思う部分があるのではないでしょうか。たとえ、恋人がいたとしても本当はお姫様のようにチヤホヤされたいのかもしれません。いざ、人からチヤホヤされても舞い上がって溺れてしまわないように注意しましょう。本当にあなたにとって大事なのは深いところで通じ合えるソウルメイトです。',
    type: 'G',
  },
  {
    id: 8,
    title: 'ゆるふわ系',
    description:
      'あなたは「ゆるふわ系」タイプです。あなたには普通に友人がいて、恋愛の経験値も積んでいるかもしれません。集団の和を大事にできるあなたは、おそらく恋愛をしてもクラッシャーのようにはならないでしょう。しかし、世の中には愛されたくても愛されなくて愛を渇望している人、気がついたら異性に好意を持たれてしまっている人がいることも忘れないであげてください。彼・彼女らは敵ではありません。',
    type: 'G',
  },
];
